xvicam/mvp/cyclist/esp32/src/main.cpp
    // Button logic in this project treats a press as HIGH (see loop()).
    constexpr int kButtonWakeLevel = 1; // 1 = HIGH, 0 = LOW

    // IMU interrupt polarity.
    constexpr int kImuWakeLevel = 1; // 1 = HIGH, 0 = LOW
    constexpr bool kImuIntActiveHigh = (kImuWakeLevel == 1);

    // Map existing motion detection (computed in AccGyro) to a still-timer.
    constexpr uint32_t kStillDebounceMs = 3000;

    enum class SleepReason : uint8_t {
        Unknown = 0,
        Button = 1,
        Still = 2
    };

    RTC_DATA_ATTR uint8_t lastSleepReason = static_cast<uint8_t>(SleepReason::Unknown);

    static SleepReason getLastSleepReason() {
        return static_cast<SleepReason>(lastSleepReason);
    }

    static void setLastSleepReason(SleepReason r) {
        lastSleepReason = static_cast<uint8_t>(r);
    }

    uint32_t stillSinceMs = 0;
    uint32_t lastMovingMs = 0;
    bool armed = false;

    static bool eligibleToSleep() {
        // Don’t sleep during bonding or while crashed.
        return (!sys::isBonding) && (!sys::isCrashed) && imuPrint::initialised;
    }

    void initPin() {
        // Keep a defined level while sleeping.
        pinMode(IMU_INT_PIN, (kImuWakeLevel == 0) ? INPUT_PULLUP : INPUT_PULLDOWN);

        pinMode(BUTTON_PIN, (kButtonWakeLevel == 1) ? INPUT_PULLDOWN : INPUT_PULLUP);
    }

    // Forward declaration (used by spurious-wake filter below)
    void enterDeepSleep(const char *reason, SleepReason sleepReason);

    void armImuInterrupt() {
        if (!imuPrint::initialised) return;

        // Route wake-up + inactivity to INT1 by default.
        // 187mg (3 steps) rejects more small vibrations while still waking on real movement.
        const bool ok = imuPrint::imu.configureWakeInactivity(30, 187, true, kImuIntActiveHigh, true);
        Serial.printf("IMU wake/inactivity config: %s (pin=%d level=%d)\n", ok ? "OK" : "FAIL", IMU_INT_PIN, kImuWakeLevel);
    }

    // Ignore EXT0 wake glitches for a short window after boot/wake.
    // This helps when the IMU interrupt line is still settling or latched.
    constexpr uint32_t kIgnoreWakeMs = 800;
    uint32_t ignoreWakeUntilMs = 0;

    // If falsely awake (e.g. IMU line still active but no WU source), go back to sleep.
    static void returnToSleepIfFalseExtWake() {
        const auto cause = esp_sleep_get_wakeup_cause();
        if (cause != ESP_SLEEP_WAKEUP_EXT1) return;
        if (!imuPrint::initialised) return;

        const uint64_t wakeMask = esp_sleep_get_ext1_wakeup_status();
        const bool wokeByButton = (wakeMask & (1ULL << BUTTON_PIN)) != 0;
        if (wokeByButton) return;

        const int pinNow = digitalRead(IMU_INT_PIN);
        const bool pinStillActive = (pinNow == kImuWakeLevel);

        bool wu = false, inact = false;
        (void)imuPrint::imu.readWakeInactivitySources(wu, inact);

        if (pinStillActive && !wu) {
            Serial.printf("Spurious EXT wake (mask=0x%llX imuPinNow=%d active=%d wu=%d inact=%d). Returning to sleep.\n",
                          static_cast<unsigned long long>(wakeMask),
                          pinNow,
                          pinStillActive ? 1 : 0,
                          wu ? 1 : 0,
                          inact ? 1 : 0);
            Serial.flush();
            delay(50);
            enterDeepSleep("spurious EXT", SleepReason::Unknown);
        }
    }

    void enterDeepSleep(const char *reason, SleepReason sleepReason) {
        Serial.printf("Entering deep sleep (%s)\n", reason ? reason : "");

        // Clear any latched IMU interrupt before sleeping.
        if (imuPrint::initialised) {
            bool wu = false, inact = false;
            (void)imuPrint::imu.readWakeInactivitySources(wu, inact);
        }

        const uint32_t waitStartMs = millis();
        bool warned = false;
        while (digitalRead(BUTTON_PIN) == kButtonWakeLevel) {
            if (!warned && (millis() - waitStartMs) > 1000) {
                Serial.println("Waiting for button release before sleep...");
                warned = true;
            }
            delay(10);
        }

        setLastSleepReason(sleepReason);

        Serial.printf("IMU_INT_PIN=%d level now=%d (wakeLevel=%d)\n", IMU_INT_PIN, digitalRead(IMU_INT_PIN), kImuWakeLevel);
        Serial.printf("BUTTON_PIN=%d level now=%d (wakeLevel=%d)\n", BUTTON_PIN, digitalRead(BUTTON_PIN), kButtonWakeLevel);
        Serial.flush();

        // Stop radios cleanly.
        espNow::stopEspNow();
        ble::stopAdvertising();

        const bool buttonOnlyWake = (sleepReason == SleepReason::Button);
        uint64_t wakeMask = (1ULL << BUTTON_PIN);
        if (!buttonOnlyWake) {
            wakeMask |= (1ULL << IMU_INT_PIN);
        }

        if (kImuWakeLevel == 1 || kButtonWakeLevel == 1) {
            esp_sleep_enable_ext1_wakeup(wakeMask, ESP_EXT1_WAKEUP_ANY_HIGH);
        } else {
            esp_sleep_enable_ext1_wakeup(wakeMask, ESP_EXT1_WAKEUP_ALL_LOW);
        }

        // Give BLE/WiFi stacks a moment to quiesce and let Serial flush.
        delay(200);
        esp_deep_sleep_start();
    }

    void onBootPrintWakeReason() {
        const auto cause = esp_sleep_get_wakeup_cause();
        Serial.print("Wake cause: ");
        switch (cause) {
            case ESP_SLEEP_WAKEUP_EXT1: {
                const uint64_t mask = esp_sleep_get_ext1_wakeup_status();
                Serial.printf("EXT1 (mask=0x%llX)", static_cast<unsigned long long>(mask));
                if (mask & (1ULL << BUTTON_PIN)) Serial.print(" [BUTTON]");
                if (mask & (1ULL << IMU_INT_PIN)) Serial.print(" [IMU]");
                Serial.println();
                break;
            }
            case ESP_SLEEP_WAKEUP_TIMER: Serial.println("TIMER"); break;
            case ESP_SLEEP_WAKEUP_UNDEFINED: Serial.println("POWERON/RESET"); break;
            default: Serial.printf("%d\n", static_cast<int>(cause)); break;
        }
    }

    void enforceHoldToWakeFromButtonOrStill() {
        const SleepReason lastReason = getLastSleepReason();
        if (lastReason != SleepReason::Button && lastReason != SleepReason::Still) return;
        if (esp_sleep_get_wakeup_cause() != ESP_SLEEP_WAKEUP_EXT1) return;

        const uint64_t mask = esp_sleep_get_ext1_wakeup_status();
        if ((mask & (1ULL << BUTTON_PIN)) == 0) return;

        constexpr uint32_t kWakeHoldMs = 2000;
        constexpr uint32_t kPollDelayMs = 2;

        if (digitalRead(BUTTON_PIN) != kButtonWakeLevel) {
            Serial.println("Wake hold not detected, returning to sleep...");
            enterDeepSleep("wake hold not met", lastReason);
        }

        const uint32_t startMs = millis();
        const uint32_t deadlineMs = startMs + kWakeHoldMs;

